/*
;*********************************************************************************************************
;*                                                
;*                            ¶ÔÏó: CRunCtrl
;*
;*                        (c) Copyright 2013-2018, ½¯Ñ©Ã·
;*                              All Rights Reserved
;*                                    Ver1.0
;* File : CRunCtrl.h
;* By   : ½¯Ñ©Ã·
;* Ê±¼ä : 2013-8-23
;*********************************************************************************************************
;*/
//#include  "CRunCtrl.h"

#ifndef CRunCtrl_H
#define CRunCtrl_H	  

#include  "Config.h" 
 
#ifdef  CRunCtrl_C
#define EX_CRunCtrl
#else
#define EX_CRunCtrl extern 
#endif

/*******************************************************************/
/******************       È«¾Ö³£Á¿¶¨Òåý     *********************/
/*******************************************************************/
//constant 
   
 
/*******************************************************************/
/******************       Êý¾Ý½á¹¹¶¨Òåý     *********************/
/*******************************************************************/
 
/*******************************************************************/
/****************     ¹«ÓÐ³ÉÔ±±äÁ¿,º¯Êý¼°³£Á¿     ******************/
/*******************************************************************/
//public:
EX_CRunCtrl   void   Init_CRunCtrl(void);    //³õÊ¼»¯

EX_CRunCtrl   void   Reset_CRunCtrl(void);    //³õÊ¼»¯ 

EX_CRunCtrl   void   do_CRunCtrl(void);    //³õÊ¼»¯  

EX_CRunCtrl   void   LpCk_CRunCtrl(void); 
 
EX_CRunCtrl   void check_response_atfire(void);
/*******************************************************************/
/********************* Ë½ÓÐ³ÉÔ±±äÁ¿,º¯Êý¼°³£Á¿    *******************/
/*******************************************************************/
//Private:
#ifdef  CRunCtrl_C  
uint8 vRunLedCount;
void  RunLed_CRunCtrl(void); 
void zijian_speaker(void);
#endif
#endif

