/*
*********************************************************************************************************
*                                                
*                            ¶ÔÏó:	CLpInfoDef
*
*                        (c) Copyright 2000-2006, ½¯Ñ©Ã·
*                              All Rights Reserved
*                                    Ver1.5
* File : CLpInfoDef.H
* By   : ½¯Ñ©Ã·
*********************************************************************************************************
*/
//#include  "CLpInfoDef.h" 

#ifndef CLpInfoDef_H
#define CLpInfoDef_H

#include  "Config.h"
 

#ifdef  CLpInfoDef_C
#define Ex_CLpInfoDef
#else
#define Ex_CLpInfoDef extern 
#endif

/*******************************************************************/
/******************       È«¾Ö³£Á¿¶¨Òåý     *********************/
/*******************************************************************/
//constant/
#define  cLpScanComm_D0	  0  //Õý³£Ñ²¼ìÃüÁî
#define  cLpScanComm_D4   1  //×´Ì¬ÀàÐÍ²éÑ¯
#define  cLpScanComm_D8   2  //Ä£ÄâÁ¿Êý¾Ý²éÑ¯
#define  cLpScanComm_D12  3  //Êý¾Ý²éÑ¯
#define  cMaxLpScanComm   4  

 
#define  cNodeState_Normal  0
#define  cNodeState_Fault   1
#define  cNodeState_Alarm   2
#define  cMaxNodeStateNum   3 

#define  cMaxNodeD12Num     9 

#define  cMaxLpScanAnsStep      10    //Êý¾Ý²éÑ¯·´À¡Êý¾Ý
#define  cMaxLpScanAnsTId       6    //·´À¡²½Öè¼ÆÊý
/*******************************************************************/
/******************       Êý¾Ý½á¹¹¶¨Òåý     *********************/
/*******************************************************************/
 
/*******************************************************************/
/****************     ¹«ÓÐ³ÉÔ±±äÁ¿,º¯Êý¼°³£Á¿     ******************/
/*******************************************************************/
//public:

Ex_CLpInfoDef  void   Init_CLpInfoDef(void);

 

 

/*******************************************************************/
/********************* Ë½ÓÐ³ÉÔ±±äÁ¿,º¯Êý¼°³£Á¿    *******************/
/*******************************************************************/
//Private:
#ifdef  CLpInfoDef_C      

 



#endif   
#endif







